import React from "react";

//에테르넬 모자
const ETEHatPotentialData = [
    {
        "grade": "rare",
        "effects": [
            {
                "first": [
                    {
                        "str":13
                    },
                    {
                        "dex":13
                    },
                    {
                        "int":13
                    },
                    {
                        "luk":13
                    },
                    {
                        "hp":125
                    },
                    {
                        "mp":125
                    },
                    {
                        "def":125
                    },
                    {
                        "strP":4
                    },
                    {
                        "dexP":4
                    },
                    {
                        "intP":4
                    },
                    {
                        "lukP":4
                    },
                    {
                        "hpP":4
                    },
                    {
                        "mpP":4
                    },
                    {
                        "defP":4
                    },
                    {
                        "allStat":6
                    },
                ]
            },
            {
                "second": [
                    {
                        "str": 6
                    },
                    {
                        "dex": 6
                    },
                    {
                        "int": 6
                    },
                    {
                        "luk": 6
                    },
                    {
                        "hp": 60
                    },
                    {
                        "mp": 60
                    },
                    {
                        "def": 60
                    },
                    {
                        "str": 13
                    },
                    {
                        "dex": 13
                    },
                    {
                        "int": 13
                    },
                    {
                        "luk": 13
                    },
                    {
                        "hp": 125
                    },
                    {
                        "mp": 125
                    },
                    {
                        "def": 125
                    },
                    {
                        "strP":4
                    },
                    {
                        "dexP":4
                    },
                    {
                        "intP":4
                    },
                    {
                        "lukP":4
                    },
                    {
                        "hpP":4
                    },
                    {
                        "mpP":4
                    },
                    {
                        "defP":4
                    },
                    {
                        "allStat":6
                    }
                ]
            }
        ]
    },
    {
        "grade": "epic",
        "effects": [
            {
                "first": [
                    {
                        "strP": 7
                    },
                    {
                        "dexP": 7
                    },
                    {
                        "intP": 7
                    },
                    {
                        "lukP": 7
                    },
                    {
                        "hpP": 7
                    },
                    {
                        "mpP": 7
                    },
                    {
                        "defP": 7
                    },
                    {
                        "allStatP": 4
                    }
                ]
            },
            {
                "second": [
                    {
                        "str": 13
                    },
                    {
                        "dex": 13
                    },
                    {
                        "int": 13
                    },
                    {
                        "luk": 13
                    },
                    {
                        "hp": 125
                    },
                    {
                        "mp": 125
                    },
                    {
                        "def": 125
                    },
                    {
                        "strP": 4
                    },
                    {
                        "dexP": 4
                    },
                    {
                        "intP": 4
                    },
                    {
                        "lukP": 4
                    },
                    {
                        "hpP": 4
                    },
                    {
                        "mpP": 4
                    },
                    {
                        "defP": 4
                    },
                    {
                        "allStat": 6
                    },
                    {
                        "strP":7
                    },
                    {
                        "dexP":7
                    },
                    {
                        "intP":7
                    },
                    {
                        "lukP":7
                    },
                    {
                        "hpP":7
                    },
                    {
                        "mpP":7
                    },
                    {
                        "defP":7
                    },
                    {
                        "allStatP":4
                    }
                ]
            }
        ]
    },
    {
        "grade": "unique",
        "effects": [
            {
                "first": [
                    {
                        "strP": 10
                    },
                    {
                        "dexP": 10
                    },
                    {
                        "intP": 10
                    },
                    {
                        "lukP": 10
                    },
                    {
                        "hpP": 10
                    },
                    {
                        "mpP": 10
                    },
                    {
                        "allStatP": 7
                    },
                    {
                        "hpHeal": 30
                    },
                    {
                      //피격시 5% 확률로 데미지의 20% 무시
                    },
                    {
                      //피격시 5% 확률로 데미지의 40% 무시
                    },
                    {
                      //<쓸만한 미스틱 도어>스킬 사용 가능
                    }
                ]
            },
            {
                "second": [
                    {
                        "strP": 7
                    },
                    {
                        "dexP": 7
                    },
                    {
                        "intP": 7
                    },
                    {
                        "lukP": 7
                    },
                    {
                        "hpP": 7
                    },
                    {
                        "mpP": 7
                    },
                    {
                        "defP": 7
                    },
                    {
                        "allStatP": 4
                    },
                    {
                        "strP":10
                    },
                    {
                        "dexP":10
                    },
                    {
                        "intP":10
                    },
                    {
                        "lukP":10
                    },
                    {
                        "hpP":10
                    },
                    {
                        "mpP":10
                    },
                    {
                        "allStatP":7
                    },
                    {
                        "hpHeal":30
                    },
                    {
                        //피격시 5% 확률로 데미지의 20% 무시
                    },
                    {
                        //피격시 5% 확률로 데미지의 40% 무시
                    },
                    {
                        //<쓸만한 미스틱 도어>스킬 사용 가능
                    }
                ]
            }
        ]
    },
    {
        "grade": "legendary",
        "effects": [
            {
                "first": [
                    {
                        "strP": 13
                    },
                    {
                        "dexP": 13
                    },
                    {
                        "intP": 13
                    },
                    {
                        "lukP": 13
                    },
                    {
                        "hpP": 13
                    },
                    {
                        "mpP": 13
                    },
                    {
                        "allStatP": 10
                    },
                    {
                        //피격 시 10% 확률로 데미지의 20% 무시
                    },
                    {
                        //피격 시 10% 확률로 데미지의 40% 무시
                    },
                    {
                        //모든 스킬의 재사용 대기시간 : -1초(10초 이하는 5%감소, 5초 미만으로 감소 불가)
                    },
                    {
                        //모든 스킬의 재사용 대기시간 : -2초(10초 이하는 10%감소, 5초 미만으로 감소 불가
                    },
                    {
                        //<쓸만한 어드밴스드 블레스> 스킬 사용 가능
                    }
                ]
            },
            {
                "second": [
                    {
                        "strP": 10
                    },
                    {
                        "dexP": 10
                    },
                    {
                        "intP": 10
                    },
                    {
                        "lukP": 10
                    },
                    {
                        "hpP": 10
                    },
                    {
                        "mpP": 10
                    },
                    {
                        "allStatP": 7
                    },
                    {
                        "hpHeal": 30
                    },
                    {
                        //피격 시 5% 확률로 데미지의 20% 무시
                    },
                    {
                        //피격 시 5% 확률로 데미지의 40% 무시
                    },
                    {
                        //<쓸만한 미스틱 도어>스킬 사용 가능
                    },
                    {
                        "strP":13
                    },
                    {
                        "dexP":13
                    },
                    {
                        "intP":13
                    },
                    {
                        "lukP":13
                    },
                    {
                        "hpP":13
                    },
                    {
                        "mpP":13
                    },
                    {
                        "allStatP":10
                    },
                    {
                        //피격 시 10% 확률로 데미지의 20% 무시
                    },
                    {
                        //피격 시 10% 확률로 데미지의 40% 무시
                    },
                    {
                        //모든 스킬의 재사용 대기시간 : -1초(10초 이하는 5%감소, 5초 미만으로 감소 불가)
                    },
                    {
                        //모든 스킬의 재사용 대기시간 : -2초(10초 이하는 10%감소, 5초 미만으로 감소 불가
                    },
                    {
                        //<쓸만한 어드밴스드 블레스> 스킬 사용 가능
                    }
                ]
            }
        ]
    }
];

export default ETEHatPotentialData;