import React from "react";

const flameData = [
    {///방어구
        "reqLev" : 100,
        "mainStat" : [18, 24, 30, 36, 42],
        "mainAndSub" : [9, 12, 15, 18, 21],
        "hp" : [900, 1200, 1500, 1800, 2100],
        "mp" : [900, 1200, 1500, 1800, 2100],
        "allStatP" : [3, 4, 5, 6, 7],
        "atk" : [3, 4, 5, 6, 7],
        "mAtk" : [3, 4, 5, 6, 7],
        "speed" : [3, 4, 5, 6, 7],
        "jump" : [3, 4, 5, 6, 7],
        "def" : [18, 24, 30, 35, 42],
        "reqLevDecrease" : [15, 20, 25, 30 ,35]
    },
    {
        "reqLev" : 110,
        "mainStat" : [18, 24, 30, 36, 42],
        "mainAndSub" : [9, 12, 15, 18, 21],
        "hp" : [990, 1320, 1650, 1980, 2310],
        "mp" : [990, 1320, 1650, 1980, 2310],
        "allStatP" : [3, 4, 5, 6, 7],
        "atk" : [3, 4, 5, 6, 7],
        "mAtk" : [3, 4, 5, 6, 7],
        "speed" : [3, 4, 5, 6, 7],
        "jump" : [3, 4, 5, 6, 7],
        "def" : [18, 24, 30, 35, 42],
        "reqLevDecrease" : [15, 20, 25, 30 ,35]
    },
    {
        "reqLev" : 120,
        "mainStat" : [21, 28, 35, 42, 49],
        "mainAndSub" : [12, 16, 20, 24, 28],
        "hp" : [1080, 1440, 1800, 2160, 2520],
        "mp" : [1080, 1440, 1800, 2160, 2520],
        "allStatP" : [3, 4, 5, 6, 7],
        "atk" : [3, 4, 5, 6, 7],
        "mAtk" : [3, 4, 5, 6, 7],
        "speed" : [3, 4, 5, 6, 7],
        "jump" : [3, 4, 5, 6, 7],
        "def" : [21, 28, 35, 42, 49],
        "reqLevDecrease" : [15, 20, 25, 30 ,35]
    },
    {
        "reqLev" : 130,
        "mainStat" : [21, 28, 35, 42, 49],
        "mainAndSub" : [12, 16, 20, 24, 28],
        "hp" : [1170, 1560, 1950, 2340, 2730],
        "mp" : [1170, 1560, 1950, 2340, 2730],
        "allStatP" : [3, 4, 5, 6, 7],
        "atk" : [3, 4, 5, 6, 7],
        "mAtk" : [3, 4, 5, 6, 7],
        "speed" : [3, 4, 5, 6, 7],
        "jump" : [3, 4, 5, 6, 7],
        "def" : [21, 28, 35, 42, 49],
        "reqLevDecrease" : [15, 20, 25, 30 ,35]
    },
    {
        "reqLev" : 140,
        "mainStat" : [24, 32, 40, 48, 56],
        "mainAndSub" : [12, 16, 20, 24, 28],
        "hp" : [1260, 1680, 2100, 2520, 2940],
        "mp" : [1260, 1680, 2100, 520, 2940],
        "allStatP" : [3, 4, 5, 6, 7],
        "atk" : [3, 4, 5, 6, 7],
        "mAtk" : [3, 4, 5, 6, 7],
        "speed" : [3, 4, 5, 6, 7],
        "jump" : [3, 4, 5, 6, 7],
        "def" : [24, 32, 40, 48, 56],
        "reqLevDecrease" : [15, 20, 25, 30 ,35]
    },
    {
        "reqLev" : 150,
        "mainStat" : [24, 32, 40, 48, 56],
        "mainAndSub" : [12, 16, 20, 24, 28],
        "hp" : [1350, 1800, 2250, 2700, 3150],
        "mp" : [1350, 1800, 2250, 2700, 3150],
        "allStatP" : [3, 4, 5, 6, 7],
        "atk" : [3, 4, 5, 6, 7],
        "mAtk" : [3, 4, 5, 6, 7],
        "speed" : [3, 4, 5, 6, 7],
        "jump" : [3, 4, 5, 6, 7],
        "def" : [24, 32, 40, 48, 56],
        "reqLevDecrease" : [15, 20, 25, 30 ,35]
    },
    {
        "reqLev" : 160,
        "mainStat" : [27, 36, 45, 54, 63],
        "mainAndSub" : [15, 20, 25, 30, 35],
        "hp" : [1440, 1920, 2400, 2880, 3360],
        "mp" : [1440, 1920, 2400, 2880, 3360],
        "allStatP" : [3, 4, 5, 6, 7],
        "atk" : [3, 4, 5, 6, 7],
        "mAtk" : [3, 4, 5, 6, 7],
        "speed" : [3, 4, 5, 6, 7],
        "jump" : [3, 4, 5, 6, 7],
        "def" : [27, 36, 45, 54, 63],
        "reqLevDecrease" : [15, 20, 25, 30 ,35]
    },
    {
        "reqLev" : 200,
        "mainStat" : [33, 44, 55, 66, 77],
        "mainAndSub" : [18, 24, 30, 36, 42],
        "hp" : [1800, 2400, 3000, 3600, 4200],
        "mp" : [1800, 2400, 3000, 3600, 4200],
        "allStatP" : [3, 4, 5, 6, 7],
        "atk" : [3, 4, 5, 6, 7],
        "mAtk" : [3, 4, 5, 6, 7],
        "speed" : [3, 4, 5, 6, 7],
        "jump" : [3, 4, 5, 6, 7],
        "def" : [33, 44, 55, 66, 77],
        "reqLevDecrease" : [15, 20, 25, 30 ,35]
    },
    {
        "reqLev" : 250,
        "mainStat" : [36, 48, 60, 72, 84],
        "mainAndSub" : [21, 28, 35, 42, 49],
        "hp" : [2100, 2700, 3500, 4200, 4900],
        "mp" : [2100, 2700, 3500, 4200, 4900],
        "allStatP" : [3, 4, 5, 6, 7],
        "atk" : [3, 4, 5, 6, 7],
        "mAtk" : [3, 4, 5, 6, 7],
        "speed" : [3, 4, 5, 6, 7],
        "jump" : [3, 4, 5, 6, 7],
        "def" : [36, 48, 60, 72, 84],
        "reqLevDecrease" : [15, 20, 25, 30 ,35]
    },
    ////무기
    {
        "name" : "Fafnir Risk Holder",//파프니르 리스크홀더
        "reqLev" : 150,
        "mainStat" : [24, 32, 40, 48, 56],
        "mainAndSub" : [12, 16, 20, 24, 28],
        "hp" : [1350, 1800, 2250, 2700, 3150],
        "mp" : [1350, 1800, 2250, 2700, 3150],
        "allStatP" : [3, 4, 5, 6, 7],
        "atk" : [11, 16, 21, 28, 36],
        "mAtk" : [11, 16, 21, 28, 36],
        "def" : [24, 32, 40, 48, 56],
        "bossDmg" : [6, 8, 10, 12, 14],
        "dmg" : [3, 4, 5, 6, 7],
        "reqLevDecrease" : [15, 20, 25, 30 ,35]
    },
    {
        "name" : "Fafnir Zeliska",//파프니르 첼리스카
        "reqLev" : 150,
        "mainStat" : [24, 32, 40, 48, 56],
        "mainAndSub" : [12, 16, 20, 24, 28],
        "hp" : [1350, 1800, 2250, 2700, 3150],
        "mp" : [1350, 1800, 2250, 2700, 3150],
        "allStatP" : [3, 4, 5, 6, 7],
        "atk" : [15, 22, 31, 40, 52],
        "mAtk" : [15, 22, 31, 40, 52],
        "def" : [24, 32, 40, 48, 56],
        "bossDmg" : [6, 8, 10, 12, 14],
        "dmg" : [3, 4, 5, 6, 7],
        "reqLevDecrease" : [15, 20, 25, 30 ,35]
    },
    {
        "name" : ["Fafnir Big Mountain", "Fafnir Perry Talon", "Fafnir Angelic Shooter", "Fafnir Split Edge"],//파프니르 빅마운틴, 파프니르 펜리르탈론, 파프니르 엔젤릭슈터, 파프니르 스플릿엣지
        "reqLev" : 150,
        "mainStat" : [24, 32, 40, 48, 56],
        "mainAndSub" : [12, 16, 20, 24, 28],
        "hp" : [1350, 1800, 2250, 2700, 3150],
        "mp" : [1350, 1800, 2250, 2700, 3150],
        "allStatP" : [3, 4, 5, 6, 7],
        "atk" : [16, 23, 31, 41, 53],
        "mAtk" : [16, 23, 31, 41, 53],
        "def" : [24, 32, 40, 48, 56],
        "bossDmg" : [6, 8, 10, 12, 14],
        "dmg" : [3, 4, 5, 6, 7],
        "reqLevDecrease" : [15, 20, 25, 30 ,35]
    },
    {
        "name" : "Fafnir Moon Glavie",//파프니르 문글레이브
        "reqLev" : 150,
        "mainStat" : [24, 32, 40, 48, 56],
        "mainAndSub" : [12, 16, 20, 24, 28],
        "hp" : [1350, 1800, 2250, 2700, 3150],
        "mp" : [1350, 1800, 2250, 2700, 3150],
        "allStatP" : [3, 4, 5, 6, 7],
        "atk" : [19, 27, 38, 49, 63],
        "mAtk" : [19, 27, 38, 49, 63],
        "def" : [24, 32, 40, 48, 56],
        "bossDmg" : [6, 8, 10, 12, 14],
        "dmg" : [3, 4, 5, 6, 7],
        "reqLevDecrease" : [15, 20, 25, 30 ,35]
    },
    {
        "name" : ["Fafnir Damascus", "Fafnir Dual Windwing", "Fafnir Dragon Ritual Fan", "Fafnir Nightchaser", "Fafnir Acient Bow", "Fafnir Chakram", "Fafnir Chain", "Fafnir Windchaser"],//파프니르 다마스커스, 파프니르 듀얼윈드윙, 파프니르 용선, 파프니르 나이트체이서, 파프니르 에이션트 보우, 파프니르 차크람, 파프니르 체인, 파프니르 윈드체이서
        "reqLev" : 150,
        "mainStat" : [24, 32, 40, 48, 56],
        "mainAndSub" : [12, 16, 20, 24, 28],
        "hp" : [1350, 1800, 2250, 2700, 3150],
        "mp" : [1350, 1800, 2250, 2700, 3150],
        "allStatP" : [3, 4, 5, 6, 7],
        "atk" : [20, 29, 39, 52, 66],
        "mAtk" : [20, 29, 39, 52, 66],
        "def" : [24, 32, 40, 48, 56],
        "bossDmg" : [6, 8, 10, 12, 14],
        "dmg" : [3, 4, 5, 6, 7],
        "reqLevDecrease" : [15, 20, 25, 30 ,35]
    },
    {
        "name" : ["Fafnir Windwing Shooter", "Fafnir Claire Ciel", "Fafnir Mistilteinn", "Fafnir Twin Cleaver", "Fafnir Guardian Hammer"],//파프니르 윈드윙슈터, 파프니르 클레르시엘, 파프니르 미스틸테인, 파프니르 트윈클리버, 파프니르 골디언해머
        "reqLev" : 150,
        "mainStat" : [24, 32, 40, 48, 56],
        "mainAndSub" : [12, 16, 20, 24, 28],
        "hp" : [1350, 1800, 2250, 2700, 3150],
        "mp" : [1350, 1800, 2250, 2700, 3150],
        "allStatP" : [3, 4, 5, 6, 7],
        "atk" : [20, 29, 40, 53, 68],
        "mAtk" : [20, 29, 40, 53, 68],
        "def" : [24, 32, 40, 48, 56],
        "bossDmg" : [6, 8, 10, 12, 14],
        "dmg" : [3, 4, 5, 6, 7],
        "reqLevDecrease" : [15, 20, 25, 30 ,35]
    },
    {
        "name" : ["Fafnir Death Bringer", "Fafnir Penitensia", "Fafnir Battle Cleaver", "Fafnir Lightninger", "Fafnir Brionak", "Fafnir Forgiveness"],//파프니르 데스브링어, 파프니르 페니텐시아, 파프니르 배틀클리버, 파프니르 라이트닝어, 파프니르 브류나크, 파프니르 포기브니스
        "reqLev" : 150,
        "mainStat" : [24, 32, 40, 48, 56],
        "mainAndSub" : [12, 16, 20, 24, 28],
        "hp" : [1350, 1800, 2250, 2700, 3150],
        "mp" : [1350, 1800, 2250, 2700, 3150],
        "allStatP" : [3, 4, 5, 6, 7],
        "atk" : [21, 31, 42, 55, 71],
        "mAtk" : [21, 31, 42, 55, 71],
        "def" : [24, 32, 40, 48, 56],
        "bossDmg" : [6, 8, 10, 12, 14],
        "dmg" : [3, 4, 5, 6, 7],
        "reqLevDecrease" : [15, 20, 25, 30 ,35]
    },
    {
        "name" : "Fafnir Lost Cannon",//파프니르 러스터캐논
        "reqLev" : 150,
        "mainStat" : [24, 32, 40, 48, 56],
        "mainAndSub" : [12, 16, 20, 24, 28],
        "hp" : [1350, 1800, 2250, 2700, 3150],
        "mp" : [1350, 1800, 2250, 2700, 3150],
        "allStatP" : [3, 4, 5, 6, 7],
        "atk" : [21, 31, 43, 56, 72],
        "mAtk" : [21, 31, 43, 56, 72],
        "def" : [24, 32, 40, 48, 56],
        "bossDmg" : [6, 8, 10, 12, 14],
        "dmg" : [3, 4, 5, 6, 7],
        "reqLevDecrease" : [15, 20, 25, 30 ,35]
    },
    {
        "name" : ["Fafnir Magic Gauntlet", "Fafnir Mana Cradle", "Fafnir Mana Taker", "Fafnir ESP limiter"],//파프니르 매직건틀렛, 파프니르 마나크래들 , 파프니르 마나테이커, 파프니르 ESP리미터
        "reqLev" : 150,
        "mainStat" : [24, 32, 40, 48, 56],
        "mainAndSub" : [12, 16, 20, 24, 28],
        "hp" : [1350, 1800, 2250, 2700, 3150],
        "mp" : [1350, 1800, 2250, 2700, 3150],
        "allStatP" : [3, 4, 5, 6, 7],
        "atk" : [25, 36, 49, 65, 83],
        "mAtk" : [25, 36, 49, 65, 83],
        "def" : [24, 32, 40, 48, 56],
        "bossDmg" : [6, 8, 10, 12, 14],
        "dmg" : [3, 4, 5, 6, 7],
        "reqLevDecrease" : [15, 20, 25, 30 ,35]
    },
    {
        "name" : "Fafnir Mana Crown",//파프니르 마나크라운
        "reqLev" : 150,
        "mainStat" : [24, 32, 40, 48, 56],
        "mainAndSub" : [12, 16, 20, 24, 28],
        "hp" : [1350, 1800, 2250, 2700, 3150],
        "mp" : [1350, 1800, 2250, 2700, 3150],
        "allStatP" : [3, 4, 5, 6, 7],
        "atk" : [25, 36, 49, 65, 83],
        "mAtk" : [25, 36, 49, 65, 83],
        "def" : [24, 32, 40, 48, 56],
        "bossDmg" : [6, 8, 10, 12, 14],
        "dmg" : [3, 4, 5, 6, 7],
        "reqLevDecrease" : [15, 20, 25, 30 ,35]
    },
    ///앱솔랩스
    {
        "name" : "AbsoLab Revenge Guard",//앱솔랩스 리벤지가즈
        "reqLev" : 160,
        "mainStat" : [27, 36, 45, 54, 63],
        "mainAndSub" : [15, 20, 25, 30, 35],
        "hp" : [1440, 1920, 2400, 2880, 3360],
        "mp" : [1440, 1920, 2400, 2880, 3360],
        "allStatP" : [3, 4, 5, 6, 7],
        "atk" : [16, 23, 32, 42, 53],
        "mAtk" : [16, 23, 32, 42, 53],
        "def" : [27, 36, 45, 54, 63],
        "bossDmg" : [6, 8, 10, 12, 14],
        "dmg" : [3, 4, 5, 6, 7],
        "reqLevDecrease" : [15, 20, 25, 30 ,35]
    },
    {
        "name" : "AbsoLab Pointing Gun",//앱솔랩스 포인팅건
        "reqLev" : 160,
        "mainStat" : [27, 36, 45, 54, 63],
        "mainAndSub" : [15, 20, 25, 30, 35],
        "hp" : [1440, 1920, 2400, 2880, 3360],
        "mp" : [1440, 1920, 2400, 2880, 3360],
        "allStatP" : [3, 4, 5, 6, 7],
        "atk" : [23, 33, 46, 60, 77],
        "mAtk" : [23, 33, 46, 60, 77],
        "def" : [27, 36, 45, 54, 63],
        "bossDmg" : [6, 8, 10, 12, 14],
        "dmg" : [3, 4, 5, 6, 7],
        "reqLevDecrease" : [15, 20, 25, 30 ,35]
    },
    {
        "name" : ["AbsoLab Pile God", "AbsoLab Blow Knuckle", "AbsoLab Soul Shooter", "AbsoLab Energy Chain"],//앱솔랩스 파일갓, 앱솔랩스 블로우너클, 앱솔랩스 소울슈터, 앱솔랩스 에너지체인
        "reqLev" : 160,
        "mainStat" : [27, 36, 45, 54, 63],
        "mainAndSub" : [15, 20, 25, 30, 35],
        "hp" : [1440, 1920, 2400, 2880, 3360],
        "mp" : [1440, 1920, 2400, 2880, 3360],
        "allStatP" : [3, 4, 5, 6, 7],
        "atk" : [24, 34, 47, 62, 79],
        "mAtk" : [24, 34, 47, 62, 79],
        "def" : [27, 36, 45, 54, 63],
        "bossDmg" : [6, 8, 10, 12, 14],
        "dmg" : [3, 4, 5, 6, 7],
        "reqLevDecrease" : [15, 20, 25, 30 ,35]
    },
    {
        "name" : "AbsoLab halberd",//앱솔랩스 핼버드
        "reqLev" : 160,
        "mainStat" : [27, 36, 45, 54, 63],
        "mainAndSub" : [15, 20, 25, 30, 35],
        "hp" : [1440, 1920, 2400, 2880, 3360],
        "mp" : [1440, 1920, 2400, 2880, 3360],
        "allStatP" : [3, 4, 5, 6, 7],
        "atk" : [28, 41, 56, 74, 95],
        "mAtk" : [28, 41, 56, 74, 95],
        "def" : [27, 36, 45, 54, 63],
        "bossDmg" : [6, 8, 10, 12, 14],
        "dmg" : [3, 4, 5, 6, 7],
        "reqLevDecrease" : [15, 20, 25, 30 ,35]
    },
    {
        "name" : ["AbsoLab Slasher", "AbosLab Dual Bowgun", "AbsoLab Monster Ritual Fan", "AbsoLab Breath Shooter", "AbsoLab Acient Bow", "AbsoLab Chakram", "AbsoLab Chain", "AbsoLab Shooting Bow"],//앱솔랩스 슬래셔, 앱솔랩스 듀얼보우건, 앱솔랩스 괴선, 앱솔랩스 브레스 슈터, 앱솔랩스 에이션트 보우, 앱솔랩스 차크람, 앱솔랩스 체인, 앱솔랩스 슈팅보우
        "reqLev" : 160,
        "mainStat" : [27, 36, 45, 54, 63],
        "mainAndSub" : [15, 20, 25, 30, 35],
        "hp" : [1440, 1920, 2400, 2880, 3360],
        "mp" : [1440, 1920, 2400, 2880, 3360],
        "allStatP" : [3, 4, 5, 6, 7],
        "atk" : [29, 43, 59, 77, 99],
        "mAtk" : [29, 43, 59, 77, 99],
        "def" : [27, 36, 45, 54, 63],
        "bossDmg" : [6, 8, 10, 12, 14],
        "dmg" : [3, 4, 5, 6, 7],
        "reqLevDecrease" : [15, 20, 25, 30 ,35]
    },
    {
        "name" : ["AbsoLab CrossBow", "AbsoLab Pincher Cane", "AbsoLab Saber", "AbsoLab Axe", "AbsoLab Bit Hammer"],//앱솔랩스 크로스보우, 앱솔랩스 핀쳐케인, 앱솔랩스 세이버, 앱솔랩스 엑스, 앱솔랩스 비트해머
        "reqLev" : 160,
        "mainStat" : [27, 36, 45, 54, 63],
        "mainAndSub" : [15, 20, 25, 30, 35],
        "hp" : [1440, 1920, 2400, 2880, 3360],
        "mp" : [1440, 1920, 2400, 2880, 3360],
        "allStatP" : [3, 4, 5, 6, 7],
        "atk" : [30, 44, 60, 79, 101],
        "mAtk" : [30, 44, 60, 79, 101],
        "def" : [27, 36, 45, 54, 63],
        "bossDmg" : [6, 8, 10, 12, 14],
        "dmg" : [3, 4, 5, 6, 7],
        "reqLevDecrease" : [15, 20, 25, 30 ,35]
    },
    {
        "name" : ["AbsoLab Desperado", "AbsoLab Broad Saber", "AbsoLab Broad Axe", "AbsoLab Broad Hammer", "AbsoLab Piercing Spear", "AbsoLab Tuner"],//앱솔랩스 데스페라도, 앱솔랩스 브로드세이버, 앱솔랩스 브로드엑스, 앱솔랩스 브로드해머, 앱솔랩스 피어싱스피어, 앱솔랩스 튜너
        "reqLev" : 160,
        "mainStat" : [27, 36, 45, 54, 63],
        "mainAndSub" : [15, 20, 25, 30, 35],
        "hp" : [1440, 1920, 2400, 2880, 3360],
        "mp" : [1440, 1920, 2400, 2880, 3360],
        "allStatP" : [3, 4, 5, 6, 7],
        "atk" : [30, 44, 60, 79, 101],
        "mAtk" : [30, 44, 60, 79, 101],
        "def" : [27, 36, 45, 54, 63],
        "bossDmg" : [6, 8, 10, 12, 14],
        "dmg" : [3, 4, 5, 6, 7],
        "reqLevDecrease" : [15, 20, 25, 30 ,35]
    },
    {
        "name" : "AbsoLab Blast Cannon",//앱솔랩스 블래스트캐논
        "reqLev" : 160,
        "mainStat" : [27, 36, 45, 54, 63],
        "mainAndSub" : [15, 20, 25, 30, 35],
        "hp" : [1440, 1920, 2400, 2880, 3360],
        "mp" : [1440, 1920, 2400, 2880, 3360],
        "allStatP" : [3, 4, 5, 6, 7],
        "atk" : [32, 47, 64, 84, 108],
        "mAtk" : [32, 47, 64, 84, 108],
        "def" : [27, 36, 45, 54, 63],
        "bossDmg" : [6, 8, 10, 12, 14],
        "dmg" : [3, 4, 5, 6, 7],
        "reqLevDecrease" : [15, 20, 25, 30 ,35]
    },
    {
        "name" : ["AbsoLab Magic Gauntlet", "AbsoLab Shining Rod", "AbsoLab Spelling Wand", "AbsoLab ESP limiter"],//앱솔랩스 매직 건틀렛, 앱솔랩스 샤이닝로드, 앱솔랩스 스펠링완드, 앱솔랩스 ESP 리미터
        "reqLev" : 160,
        "mainStat" : [27, 36, 45, 54, 63],
        "mainAndSub" : [15, 20, 25, 30, 35],
        "hp" : [1440, 1920, 2400, 2880, 3360],
        "mp" : [1440, 1920, 2400, 2880, 3360],
        "allStatP" : [3, 4, 5, 6, 7],
        "atk" : [37, 54, 73, 97, 124],
        "mAtk" : [37, 54, 73, 97, 124],
        "def" : [27, 36, 45, 54, 63],
        "bossDmg" : [6, 8, 10, 12, 14],
        "dmg" : [3, 4, 5, 6, 7],
        "reqLevDecrease" : [15, 20, 25, 30 ,35]
    },
    {
        "name" : "AbsoLab Spelling Staff",//앱솔랩스 스펠링스태프
        "reqLev" : 160,
        "mainStat" : [27, 36, 45, 54, 63],
        "mainAndSub" : [15, 20, 25, 30, 35],
        "hp" : [1440, 1920, 2400, 2880, 3360],
        "mp" : [1440, 1920, 2400, 2880, 3360],
        "allStatP" : [3, 4, 5, 6, 7],
        "atk" : [37, 54, 75, 98, 126],
        "mAtk" : [37, 54, 75, 98, 126],
        "def" : [27, 36, 45, 54, 63],
        "bossDmg" : [6, 8, 10, 12, 14],
        "dmg" : [3, 4, 5, 6, 7],
        "reqLevDecrease" : [15, 20, 25, 30 ,35]
    },
    //아케인셰이드
    {
        "name" : "Acane Shade Guard",//아케인셰이드 가즈
        "reqLev" : 200,
        "mainStat" : [33, 44, 55, 66, 77],
        "mainAndSub" : [18, 24, 30, 36, 42],
        "hp" : [1800, 2400, 3000, 3600, 4200],
        "mp" : [1800, 2400, 3000, 3600, 4200],
        "allStatP" : [3, 4, 5, 6, 7],
        "atk" : [27, 40, 55, 72, 92],
        "mAtk" : [27, 40, 55, 72, 92],
        "def" : [33, 44, 55, 66, 77],
        "bossDmg" : [6, 8, 10, 12, 14],
        "dmg" : [3, 4, 5, 6, 7],
        "reqLevDecrease" : [15, 20, 25, 30 ,35]
    },
    {
        "name" : "Acane Shade Pistol",//아케인셰이드 피스톨
        "reqLev" : 200,
        "mainStat" : [33, 44, 55, 66, 77],
        "mainAndSub" : [18, 24, 30, 36, 42],
        "hp" : [1800, 2400, 3000, 3600, 4200],
        "mp" : [1800, 2400, 3000, 3600, 4200],
        "allStatP" : [3, 4, 5, 6, 7],
        "atk" : [39, 58, 79, 104, 133],
        "mAtk" : [39, 58, 79, 104, 133],
        "def" : [33, 44, 55, 66, 77],
        "bossDmg" : [6, 8, 10, 12, 14],
        "dmg" : [3, 4, 5, 6, 7],
        "reqLevDecrease" : [15, 20, 25, 30 ,35]
    },
    {
        "name" : ["Acane Shade Ellaha", "Acane Shade Claw", "Acane Shade Soul Shooter", "Acane Shade Energy Chain"],//아케인셰이드 엘라하, 아케인셰이드 클로, 아케인셰이드 소울슈터, 아케인셰이드 에너지체인
        "reqLev" : 200,
        "mainStat" : [33, 44, 55, 66, 77],
        "mainAndSub" : [18, 24, 30, 36, 42],
        "hp" : [1800, 2400, 3000, 3600, 4200],
        "mp" : [1800, 2400, 3000, 3600, 4200],
        "allStatP" : [3, 4, 5, 6, 7],
        "atk" : [48, 59, 81, 106, 136],
        "mAtk" : [48, 59, 81, 106, 136],
        "def" : [33, 44, 55, 66, 77],
        "bossDmg" : [6, 8, 10, 12, 14],
        "dmg" : [3, 4, 5, 6, 7],
        "reqLevDecrease" : [15, 20, 25, 30 ,35]
    },
    {
        "name" : "Acane Shade Polearm",//아케인셰이드 폴암
        "reqLev" : 200,
        "mainStat" : [33, 44, 55, 66, 77],
        "mainAndSub" : [18, 24, 30, 36, 42],
        "hp" : [1800, 2400, 3000, 3600, 4200],
        "mp" : [1800, 2400, 3000, 3600, 4200],
        "allStatP" : [3, 4, 5, 6, 7],
        "atk" : [48, 70, 96, 126, 163],
        "mAtk" : [48, 70, 96, 126, 163],
        "def" : [33, 44, 55, 66, 77],
        "bossDmg" : [6, 8, 10, 12, 14],
        "dmg" : [3, 4, 5, 6, 7],
        "reqLevDecrease" : [15, 20, 25, 30 ,35]
    },
    {
        "name" : ["Acane Shade Dagger", "Acane Shade Dual Bowgun", "Acane Shade Super Ritual Fan", "Acane Shade Breath Shooter", "Acane Shade Acient Bow", "Acane Shade Chakram", "Acane Shade Chain", "Acane Shade Bow"],//아케인셰이드 대거, 아케인셰이드 듀얼보우건, 아케인셰이드 초선, 아케인셰이드 브레스 슈터, 아케인셰이드 에이션트 보우, 아케인셰이드 차크람, 아케인셰이드 체인, 아케인셰이드 보우
        "reqLev" : 200,
        "mainStat" : [33, 44, 55, 66, 77],
        "mainAndSub" : [18, 24, 30, 36, 42],
        "hp" : [1800, 2400, 3000, 3600, 4200],
        "mp" : [1800, 2400, 3000, 3600, 4200],
        "allStatP" : [3, 4, 5, 6, 7],
        "atk" : [50, 73, 101, 133, 170],
        "mAtk" : [50, 73, 101, 133, 170],
        "def" : [33, 44, 55, 66, 77],
        "bossDmg" : [6, 8, 10, 12, 14],
        "dmg" : [3, 4, 5, 6, 7],
        "reqLevDecrease" : [15, 20, 25, 30 ,35]
    },
    {
        "name" : ["Acane Shade CrossBow", "Acane Shade Cane", "Acane Shade Saber", "Acane Shade Axe", "Acane Shade Hammer"],//아케인셰이드 크로스보우, 아케인셰이드 케인, 아케인셰이드 세이버, 아케인셰이드 엑스, 아케인셰이드 해머
        "reqLev" : 200,
        "mainStat" : [33, 44, 55, 66, 77],
        "mainAndSub" : [18, 24, 30, 36, 42],
        "hp" : [1800, 2400, 3000, 3600, 4200],
        "mp" : [1800, 2400, 3000, 3600, 4200],
        "allStatP" : [3, 4, 5, 6, 7],
        "atk" : [51, 75, 103, 136, 175],
        "mAtk" : [51, 75, 103, 136, 175],
        "def" : [33, 44, 55, 66, 77],
        "bossDmg" : [6, 8, 10, 12, 14],
        "dmg" : [3, 4, 5, 6, 7],
        "reqLevDecrease" : [15, 20, 25, 30 ,35]
    },
    {
        "name" : ["Acane Shade Desperado", "Acane Shade Two Hand Sword", "Acane Shade Two Hand Axe", "Acane Shade Two Hand Hammer", "Acane Shade Spear", "Acane Shade Tuner"],//아케인셰이드 데스페라도, 아케인셰이드 투핸드소드, 아케인셰이드 투핸드엑스, 아케인셰이드 투핸드해머, 아케인셰이드 스피어, 아케인셰이드 튜너
        "reqLev" : 200,
        "mainStat" : [33, 44, 55, 66, 77],
        "mainAndSub" : [18, 24, 30, 36, 42],
        "hp" : [1800, 2400, 3000, 3600, 4200],
        "mp" : [1800, 2400, 3000, 3600, 4200],
        "allStatP" : [3, 4, 5, 6, 7],
        "atk" : [54, 78, 108, 142, 182],
        "mAtk" : [54, 78, 108, 142, 182],
        "def" : [33, 44, 55, 66, 77],
        "bossDmg" : [6, 8, 10, 12, 14],
        "dmg" : [3, 4, 5, 6, 7],
        "reqLevDecrease" : [15, 20, 25, 30 ,35]
    },
    {
        "name" : "Acane Shade Siege Gun",//아케인셰이드 시즈건
        "reqLev" : 200,
        "mainStat" : [33, 44, 55, 66, 77],
        "mainAndSub" : [18, 24, 30, 36, 42],
        "hp" : [1800, 2400, 3000, 3600, 4200],
        "mp" : [1800, 2400, 3000, 3600, 4200],
        "allStatP" : [3, 4, 5, 6, 7],
        "atk" : [55, 80, 110, 145, 186],
        "mAtk" : [55, 80, 110, 145, 186],
        "def" : [33, 44, 55, 66, 77],
        "bossDmg" : [6, 8, 10, 12, 14],
        "dmg" : [3, 4, 5, 6, 7],
        "reqLevDecrease" : [15, 20, 25, 30 ,35]
    },
    {
        "name" : ["Acane Shade Magic Gauntlet", "Acane Shade Shining Rod", "Acane Shade Wand", "Acane Shade ESP limiter"],//아케인셰이드 매직 건틀렛, 아케인셰이드 샤이닝로드, 아케인셰이드 완드, 아케인셰이드 ESP 리미터
        "reqLev" : 200,
        "mainStat" : [33, 44, 55, 66, 77],
        "mainAndSub" : [18, 24, 30, 36, 42],
        "hp" : [1800, 2400, 3000, 3600, 4200],
        "mp" : [1800, 2400, 3000, 3600, 4200],
        "allStatP" : [3, 4, 5, 6, 7],
        "atk" : [63, 92, 116, 167, 214],
        "mAtk" : [63, 92, 116, 167, 214],
        "def" : [33, 44, 55, 66, 77],
        "bossDmg" : [6, 8, 10, 12, 14],
        "dmg" : [3, 4, 5, 6, 7],
        "reqLevDecrease" : [15, 20, 25, 30 ,35]
    },
    {
        "name" : "Acane Shade Staff",//아케인 셰이드 스태프
        "reqLev" : 200,
        "mainStat" : [33, 44, 55, 66, 77],
        "mainAndSub" : [18, 24, 30, 36, 42],
        "hp" : [1800, 2400, 3000, 3600, 4200],
        "mp" : [1800, 2400, 3000, 3600, 4200],
        "allStatP" : [3, 4, 5, 6, 7],
        "atk" : [64, 94, 129, 170, 218],
        "mAtk" : [64, 94, 129, 170, 218],
        "def" : [33, 44, 55, 66, 77],
        "bossDmg" : [6, 8, 10, 12, 14],
        "dmg" : [3, 4, 5, 6, 7],
        "reqLevDecrease" : [15, 20, 25, 30 ,35]
    },
    //제네시스
    {
        "name" : "Genesis Guard",//제네시스 가즈
        "reqLev" : 250,
        "mainStat" : [36, 48, 60, 72, 84],
        "mainAndSub" : [21, 28, 35, 42, 49],
        "hp" : [2100, 2700, 3500, 4200, 4900],
        "mp" : [2100, 2700, 3500, 4200, 4900],
        "allStatP" : [3, 4, 5, 6, 7],
        "atk" : [31, 46, 72, 83, 106],
        "mAtk" : [31, 46, 72, 83, 106],
        "def" : [36, 48, 60, 72, 84],
        "bossDmg" : [6, 8, 10, 12, 14],
        "dmg" : [3, 4, 5, 6, 7],
        "reqLevDecrease" : [15, 20, 25, 30 ,35]
    },
    {
        "name" : "Genesis Pistol",//제네시스 피스톨
        "reqLev" : 250,
        "mainStat" : [36, 48, 60, 72, 84],
        "mainAndSub" : [21, 28, 35, 42, 49],
        "hp" : [2100, 2700, 3500, 4200, 4900],
        "mp" : [2100, 2700, 3500, 4200, 4900],
        "allStatP" : [3, 4, 5, 6, 7],
        "atk" : [45, 66, 91, 120, 154],
        "mAtk" : [45, 66, 91, 120, 154],
        "def" : [36, 48, 60, 72, 84],
        "bossDmg" : [6, 8, 10, 12, 14],
        "dmg" : [3, 4, 5, 6, 7],
        "reqLevDecrease" : [15, 20, 25, 30 ,35]
    },
    {
        "name" : ["Genesis Ellaha", "Genesis Claw", "Genesis Soul Shooter", "Genesis Energy Chain"],//제네시스 엘라하, 제네시스 클로, 제네시스 소울슈터, 제네시스 에너지체인
        "reqLev" : 250,
        "mainStat" : [36, 48, 60, 72, 84],
        "mainAndSub" : [21, 28, 35, 42, 49],
        "hp" : [2100, 2700, 3500, 4200, 4900],
        "mp" : [2100, 2700, 3500, 4200, 4900],
        "allStatP" : [3, 4, 5, 6, 7],
        "atk" : [46, 68, 106, 123, 154],
        "mAtk" : [46, 68, 106, 123, 154],
        "def" : [36, 48, 60, 72, 84],
        "bossDmg" : [6, 8, 10, 12, 14],
        "dmg" : [3, 4, 5, 6, 7],
        "reqLevDecrease" : [15, 20, 25, 30 ,35]
    },
    {
        "name" : "Genesis Polearm",//제네시스 폴암
        "reqLev" : 250,
        "mainStat" : [36, 48, 60, 72, 84],
        "mainAndSub" : [21, 28, 35, 42, 49],
        "hp" : [2100, 2700, 3500, 4200, 4900],
        "mp" : [2100, 2700, 3500, 4200, 4900],
        "allStatP" : [3, 4, 5, 6, 7],
        "atk" : [55, 81, 111, 146, 187],
        "mAtk" : [55, 81, 111, 146, 187],
        "def" : [36, 48, 60, 72, 84],
        "bossDmg" : [6, 8, 10, 12, 14],
        "dmg" : [3, 4, 5, 6, 7],
        "reqLevDecrease" : [15, 20, 25, 30 ,35]
    },
    {
        "name" : ["Genesis Dagger", "Genesis Dual Bowgun", "Genesis Ritual Fan", "Genesis Breath Shooter", "Genesis Acient Bow", "Genesis Chakram", "Genesis Chain", "Genesis Bow"],//제네시스 대거, 제네시스 듀얼보우건,제네시스 창세선, 제네시스 브레스 슈터, 제네시스 에이션트 보우, 제네시스 차크람, 제네시스 체인, 제네시스 보우
        "reqLev" : 250,
        "mainStat" : [36, 48, 60, 72, 84],
        "mainAndSub" : [21, 28, 35, 42, 49],
        "hp" : [2100, 2700, 3500, 4200, 4900],
        "mp" : [2100, 2700, 3500, 4200, 4900],
        "allStatP" : [3, 4, 5, 6, 7],
        "atk" : [58, 84, 111, 146, 187],
        "mAtk" : [58, 84, 111, 146, 187],
        "def" : [36, 48, 60, 72, 84],
        "bossDmg" : [6, 8, 10, 12, 14],
        "dmg" : [3, 4, 5, 6, 7],
        "reqLevDecrease" : [15, 20, 25, 30 ,35]
    },
    {
        "name" : ["Genesis CrossBow", "Genesis Cane", "Genesis Saber", "Genesis Axe", "Genesis Hammer"],//제네시스 크로스보우, 제네시스 케인, 제네시스 세이버, 제네시스 엑스, 제네시스 해머
        "reqLev" : 250,
        "mainStat" : [36, 48, 60, 72, 84],
        "mainAndSub" : [21, 28, 35, 42, 49],
        "hp" : [2100, 2700, 3500, 4200, 4900],
        "mp" : [2100, 2700, 3500, 4200, 4900],
        "allStatP" : [3, 4, 5, 6, 7],
        "atk" : [59, 87, 119, 157, 201],
        "mAtk" : [59, 87, 119, 157, 201],
        "def" : [36, 48, 60, 72, 84],
        "bossDmg" : [6, 8, 10, 12, 14],
        "dmg" : [3, 4, 5, 6, 7],
        "reqLevDecrease" : [15, 20, 25, 30 ,35]
    },
    {
        "name" : ["Genesis Desperado", "Genesis Two Hand Sword", "Genesis Two Hand Axe", "Genesis Two Hand Hammer", "Genesis Spear", "Genesis Tuner"],//제네시스 데스페라도, 제네시스 투핸드소드, 제네시스 투핸드엑스, 제네시스 투핸드해머, 제네시스 스피어, 제네시스 튜너
        "reqLev" : 250,
        "mainStat" : [36, 48, 60, 72, 84],
        "mainAndSub" : [21, 28, 35, 42, 49],
        "hp" : [2100, 2700, 3500, 4200, 4900],
        "mp" : [2100, 2700, 3500, 4200, 4900],
        "allStatP" : [3, 4, 5, 6, 7],
        "atk" : [62, 90, 124, 164, 210],
        "mAtk" : [62, 90, 124, 164, 210],
        "def" : [36, 48, 60, 72, 84],
        "bossDmg" : [6, 8, 10, 12, 14],
        "dmg" : [3, 4, 5, 6, 7],
        "reqLevDecrease" : [15, 20, 25, 30 ,35]
    },
    {
        "name" : "Genesis Siege Gun",//제네시스 시즈건
        "reqLev" : 250,
        "mainStat" : [36, 48, 60, 72, 84],
        "mainAndSub" : [21, 28, 35, 42, 49],
        "hp" : [2100, 2700, 3500, 4200, 4900],
        "mp" : [2100, 2700, 3500, 4200, 4900],
        "allStatP" : [3, 4, 5, 6, 7],
        "atk" : [63, 92, 127, 167, 214],
        "mAtk" : [63, 92, 127, 167, 214],
        "def" : [36, 48, 60, 72, 84],
        "bossDmg" : [6, 8, 10, 12, 14],
        "dmg" : [3, 4, 5, 6, 7],
        "reqLevDecrease" : [15, 20, 25, 30 ,35]
    },
    {
        "name" : ["Genesis Shade Magic Gauntlet", "Genesis Shining Rod", "Genesis Wand", "Genesis ESP limiter"],//제네시스 매직 건틀렛, 제네시스 샤이닝로드, 제네시스 완드, 제네시스 ESP 리미터
        "reqLev" : 250,
        "mainStat" : [36, 48, 60, 72, 84],
        "mainAndSub" : [21, 28, 35, 42, 49],
        "hp" : [2100, 2700, 3500, 4200, 4900],
        "mp" : [2100, 2700, 3500, 4200, 4900],
        "allStatP" : [3, 4, 5, 6, 7],
        "atk" : [72, 106, 146, 192, 246],
        "mAtk" : [27, 40, 55, 72, 92],
        "def" : [36, 48, 60, 72, 84],
        "bossDmg" : [6, 8, 10, 12, 14],
        "dmg" : [3, 4, 5, 6, 7],
        "reqLevDecrease" : [15, 20, 25, 30 ,35]
    },
    {
        "name" : "Genesis Staff",//제네시스 스태프
        "reqLev" : 250,
        "mainStat" : [36, 48, 60, 72, 84],
        "mainAndSub" : [21, 28, 35, 42, 49],
        "hp" : [2100, 2700, 3500, 4200, 4900],
        "mp" : [2100, 2700, 3500, 4200, 4900],
        "allStatP" : [3, 4, 5, 6, 7],
        "atk" : [74, 108, 148, 195, 250],
        "mAtk" : [74, 108, 148, 195, 250],
        "def" : [36, 48, 60, 72, 84],
        "bossDmg" : [6, 8, 10, 12, 14],
        "dmg" : [3, 4, 5, 6, 7],
        "reqLevDecrease" : [15, 20, 25, 30 ,35]
    },
];

export default flameData;
//100,110,120,130,140,150,160,200,250