export const DetailText = {
    str : {
        title : "힘(STR)",
        text : `전사 및 일부 해적 계열 직업의 데미지를 결정하는 가장 
                중요한 능력치이다. 능력치의 기본 수치의 총합과
                능력치 % 증가분의 곱 연산으로 최종 결정 된다. 
                단, % 미적용 수치는 곱 연산에서 제외된다.`
    },
    dex : {
        title : "민첩(DEX)",
        text : `궁수 및 일부 해적 계열 직업의 데미지를 결정하는 가장 
                중요한 능력치이다. 능력치의 기본 수치의 총합과
                능력치 % 증가분의 곱 연산으로 최종 결정 된다. 
                단, % 미적용 수치는 곱 연산에서 제외된다.`
    },
    int : {
        title : "지력(INT)",
        text : `마법사 계열 직업의 데미지를 결정하는 가장 
                중요한 능력치이다. 능력치의 기본 수치의 총합과
                능력치 % 증가분의 곱 연산으로 최종 결정 된다. 
                단, % 미적용 수치는 곱 연산에서 제외된다.`
    },
    luk : {
        title : "운(LUK)",
        text : `도적 계열 직업의 데미지를 결정하는 가장 
                중요한 능력치이다. 능력치의 기본 수치의 총합과
                능력치 % 증가분의 곱 연산으로 최종 결정 된다.
                단, % 미적용 수치는 곱 연산에서 제외된다.`
    },
    hp : {
        title : "체력(HP)",
        text : `데붕이`
    },
    mp : {
        title : "마나(MP)",
        text : `wp`,
    }
}